<template>
    <div>
        <Swiper class="swiper" :options="swiperOption">
            <SwiperSlide class="text">
                <div class="centent">
                    原标题：考古发现殉葬的妃嫔，竟然双腿分开，她们临死前究竟遭遇了什么？
                    在古代，有一种非常残酷的制度，名为殉葬。
                    顾名思义，殉葬是指某个权势人物去世后（一般是帝王），需要有一批人，跟着他去另一个世界，继续服侍他。
                    或许我们都以为，殉葬只是发生在原始社会的一种陋习，等到秦始皇一统六国，鼓捣出兵马俑之后，就该消失殆尽，成为史书上的春秋一笔。
                    确实，秦朝过后的汉唐，殉葬改成了陪葬，达官显宦正常死后，才会陪葬皇陵附近，比如凌烟阁的功臣中，就有不少陪葬唐太宗李世民的昭陵，对他们来说，是一种莫大荣誉。
                    然而到了宋朝，边疆民族先后入主中原，他们还没完全开化，所以人殉再次出现，明朝、清朝皆有。
                    通常来讲，殉葬的主要对象，是帝王的妃嫔们！
                    封建社会，等级森严，正所谓君要臣死，臣不得不死，皇帝的权力，凌驾于任何人之上。
                    因此，就有了一条不成文的规矩，皇帝可以拥有三宫六院七十二妃，这是最低标准，最高标准则是后宫佳丽三千人。
                    别看伴君如伴虎，但真正得到了皇帝的宠爱，就能恩惠家族，古代多少外戚掌权，不都是得益于家族里有个女子，在跟皇帝吹耳旁风？
                    所以，臣子们，几乎都想把自己的女儿或者妹妹，送给皇帝！
                    毕竟古代没有计划生育，而且女子地位低，只能听命父亲或者兄长的操控。
                    比如李延年，一首《北方有佳人》，“一顾倾人城，再顾倾人国”，就把妹妹李夫人“推销”给汉武帝刘彻。
                    妃子多了，其实也麻烦。
                    乱花渐欲迷人眼嘛！
                    以致好多女子，进了宫廷，根本就没有伺候皇帝的机会，甚至连皇帝的面都见不着。
                    并且，就算皇帝临幸，也未必一击必中！
                    那么，没给皇帝做出应有“贡献”的这些妃子们，会有怎样结局呢？
                    生在汉唐，妃子们的人生，就到头了，希望下辈子投个好胎吧，皇帝一死，她们就得削发为尼，长伴青灯古佛，比如武则天，李世民死后，她就去了感业寺出家。
                    如果生的不好，那就糟了，大好的青春年华，没来得及享受不说，还得给那个没得感情的糟老头子殉葬。
                    殉葬的方式，有两种。
                    一是直接杀了。用一杯毒酒、水银。一尺白绫等。都是懵懂无知的小女孩，她们怕吗？当然怕，“当死之日，皆饷于庭，饷撤，俱引升堂，哭声震殿阁”，但怕也没用，一旁的太监，会逼迫她们去追随先帝。
                    二是间接弄死。将未生育的妃嫔们，送葬时驱赶至皇陵里面，然后关闭地宫，任凭她们在暗无天日的皇陵里，等待死亡的降临。这就是“活葬”。
                    后来，有考古发现一个奇怪现象，殉葬的妃嫔们，她们的双腿，是分开的。
                    为什么会这样呢？考古工作者给出了答案！
                    原来，人在临死前，会做出很多无意识的动作。
                    尤其是殉葬的妃嫔，她们都不是正常死亡。
                    更何况，殉葬过程中，无论是何种方式，必定经历痛苦的挣扎，会处在一个极度恐惧、害怕的状态中，挣扎、无助，导致死后的姿势奇形怪状。
                    所以双腿分开，也在情理之中！
                </div>
            </SwiperSlide>
        </Swiper>
    </div>
</template>

<script>
    import { Swiper, SwiperSlide } from "vue-awesome-swiper";
    import "swiper/css/swiper.css";
    export default {
        data() {
            return {
                swiperOption: {
                    direction: "vertical",
                    slidesPerView: "auto",
                    freeMode: true,
                    mousewheel: true
                }
            };
        },
        components: { Swiper, SwiperSlide }
    };
</script>

<style scoped>
    .swiper {
        height: 300px;
        overflow: hidden;
    }
    .text {
        font-size: 18px !important;
        text-align: left;
        padding: 30px;
        height: auto;
        -webkit-box-sizing: border-box;
        box-sizing: border-box;
    }
</style>